import React from 'react';
import './styles/Main2.css';
import Header from './Header';

const Test = () => {
    const data = [
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 8,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 2,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 3,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 4,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 5,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 6,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 7,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 8,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 9,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 10,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 8,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 2,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 3,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 4,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 5,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 6,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 7,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 8,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 9,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 10,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 8,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 2,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 3,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 4,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 5,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 6,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 7,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 8,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 9,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 10,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 8,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 2,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 3,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 4,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 5,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 6,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 7,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 8,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 9,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
        {
            lecture: '강의명',
            professor: '교수명',
            grade: 10,
            desc: '강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.강의설명입니다.',
        },
    ];
    return (
        <div id="test">
            <div className="headerWrap">
                <Header></Header>
            </div>
            <div className="bodyWrap">
                <div className="sideWrap">
                    <p>사이드바입니다.</p>
                </div>
                <div className="contentWrap">
                    <div class="cardList">
                        {data.map((item, idx) => (
                            <Card
                                lecture={item.lecture}
                                professor={item.professor}
                                grade={item.grade}
                                desc={item.desc}
                            />
                        ))}
                    </div>
                </div>
            </div>
        </div>
    );
};

const Card = ({ lecture, professor, grade, desc }) => {
    return (
        <div class="card">
            <div className="thumb">
                <img src="" alt="thumbnail" />
            </div>
            <div className="infoWrap">
                <div className="lecture">{lecture}</div>
                <div className="professor">{professor}</div>
                <div className="grade">
                    <Grade grade={grade} />
                </div>
            </div>
            <div className="descWrap">
                <div className="lecture">{lecture}</div>
                <div className="desc">{desc}</div>
            </div>
        </div>
    );
};

const Grade = ({ grade }) => {
    const stars = Math.floor(grade / 2);
    const halfStar = grade % 2;
    return (
        <div className="gradeWrap">
            {stars >= 1 ? (
                <svg viewBox="0 0 24 24" width="12" height="12" fill="#FFBA00">
                    <path d="M1.327,12.4,4.887,15,3.535,19.187A3.178,3.178,0,0,0,4.719,22.8a3.177,3.177,0,0,0,3.8-.019L12,20.219l3.482,2.559a3.227,3.227,0,0,0,4.983-3.591L19.113,15l3.56-2.6a3.227,3.227,0,0,0-1.9-5.832H16.4L15.073,2.432a3.227,3.227,0,0,0-6.146,0L7.6,6.568H3.231a3.227,3.227,0,0,0-1.9,5.832Z" />
                </svg>
            ) : (
                <></>
            )}
            {stars >= 2 ? (
                <svg viewBox="0 0 24 24" width="12" height="12" fill="#FFBA00">
                    <path d="M1.327,12.4,4.887,15,3.535,19.187A3.178,3.178,0,0,0,4.719,22.8a3.177,3.177,0,0,0,3.8-.019L12,20.219l3.482,2.559a3.227,3.227,0,0,0,4.983-3.591L19.113,15l3.56-2.6a3.227,3.227,0,0,0-1.9-5.832H16.4L15.073,2.432a3.227,3.227,0,0,0-6.146,0L7.6,6.568H3.231a3.227,3.227,0,0,0-1.9,5.832Z" />
                </svg>
            ) : (
                <></>
            )}
            {stars >= 3 ? (
                <svg viewBox="0 0 24 24" width="12" height="12" fill="#FFBA00">
                    <path d="M1.327,12.4,4.887,15,3.535,19.187A3.178,3.178,0,0,0,4.719,22.8a3.177,3.177,0,0,0,3.8-.019L12,20.219l3.482,2.559a3.227,3.227,0,0,0,4.983-3.591L19.113,15l3.56-2.6a3.227,3.227,0,0,0-1.9-5.832H16.4L15.073,2.432a3.227,3.227,0,0,0-6.146,0L7.6,6.568H3.231a3.227,3.227,0,0,0-1.9,5.832Z" />
                </svg>
            ) : (
                <></>
            )}
            {stars >= 4 ? (
                <svg viewBox="0 0 24 24" width="12" height="12" fill="#FFBA00">
                    <path d="M1.327,12.4,4.887,15,3.535,19.187A3.178,3.178,0,0,0,4.719,22.8a3.177,3.177,0,0,0,3.8-.019L12,20.219l3.482,2.559a3.227,3.227,0,0,0,4.983-3.591L19.113,15l3.56-2.6a3.227,3.227,0,0,0-1.9-5.832H16.4L15.073,2.432a3.227,3.227,0,0,0-6.146,0L7.6,6.568H3.231a3.227,3.227,0,0,0-1.9,5.832Z" />
                </svg>
            ) : (
                <></>
            )}
            {stars >= 5 ? (
                <svg viewBox="0 0 24 24" width="12" height="12" fill="#FFBA00">
                    <path d="M1.327,12.4,4.887,15,3.535,19.187A3.178,3.178,0,0,0,4.719,22.8a3.177,3.177,0,0,0,3.8-.019L12,20.219l3.482,2.559a3.227,3.227,0,0,0,4.983-3.591L19.113,15l3.56-2.6a3.227,3.227,0,0,0-1.9-5.832H16.4L15.073,2.432a3.227,3.227,0,0,0-6.146,0L7.6,6.568H3.231a3.227,3.227,0,0,0-1.9,5.832Z" />
                </svg>
            ) : (
                <></>
            )}
            {halfStar === 1 ? (
                <svg viewBox="0 0 24 24" width="12" height="12" fill="#FFBA00">
                    <path d="m6.635,23.228c-.749,0-1.432-.273-1.919-.625-.878-.631-1.715-1.956-1.18-3.608l1.352-4.184-3.561-2.603C-.073,11.187-.173,9.624.167,8.596c.329-1.02,1.331-2.219,3.064-2.219h4.369l1.327-4.137c.53-1.653,1.986-2.24,3.072-2.24.553,0,1,.448,1,1v17.786c0,.318-.151.617-.408.806l-4.075,2.995c-.624.461-1.274.641-1.882.641Z" />
                </svg>
            ) : (
                <></>
            )}
        </div>
    );
};

export default Test;
